# Lab: Grouping and merging dataframes

Read the files prices.csv (from the previous exercise) and sales.csv

In [1]:
import pandas as pd

prices_df = pd.read_csv('../data/prices.csv')
sales_df = pd.read_csv('../data/sales.csv')

prices_df.head()

       sku category    price
0  sku0000  Toilets  2085.11
1  sku0001     Misc  3601.62
2  sku0002     Misc     0.57
3  sku0003  Faucets  1511.66
4  sku0004  Toilets   733.78

Examine their structure

In [2]:
sales_df.head()

   order_num  line_num        date       sku  qty
0          0         0  2011-01-01   sku4333    6
1          0         1  2011-01-01  sku76536    7
2          1         0  2011-01-02  sku75108    3
3          1         1  2011-01-02  sku78838    9
4          1         2  2011-01-02  sku77480    9

Create a new dataframe that merges the price and category data with the sales data

In [3]:
sales_with_prices = pd.merge(sales_df, prices_df)

sales_with_prices.head()

   order_num  line_num        date       sku  qty category    price
0          0         0  2011-01-01   sku4333    6  Showers  1563.90
1        641         3  2012-10-10   sku4333    8  Showers  1563.90
2          0         1  2011-01-01  sku76536    7  Faucets  3121.99
3          1         0  2011-01-02  sku75108    3     Misc   819.55
4          1         1  2011-01-02  sku78838    9  Showers  2531.54

Create a dataframe indexed by order number that contains the total price for the order

In [5]:
sales_with_prices['extended'] = sales_with_prices.qty * sales_with_prices['price']

In [9]:
order_prices = sales_with_prices.groupby('order_num').extended.sum()
order_prices.head()

order_num
0    31237.33
1    32879.28
2    32284.50
3    50845.71
4    17308.97
Name: extended, dtype: float64

Create a dataframe with the monthly average sales per category

In [12]:
sales_with_month = sales_with_prices.copy()
sales_with_month['month'] = pd.DatetimeIndex(sales_df['date']).month

columns = ['qty', 'extended']
monthly_sales = sales_with_month.groupby(['month', 'category'])[columns].sum()
monthly_sales.columns = ['units', 'revenue']
monthly_sales.head()

                units    revenue
month category
1     Faucets     244  599846.06
      Misc        300  591761.89
      Showers     275  780515.61
      Toilets     160  360714.35
2     Faucets     194  464488.27